
answers_dict = {
    '52': '4',  # 如何更改用户名？ 没有这个功能
    '69': ['1', '2', '4'],  # 下列哪些做法使人蛋疼
    '109': '8',  # 无论怎样,硬盘都会红的
    '126': '8',  # 阿拉丁在摩擦了神灯
    '139': '2',  # 《Code Geass 反叛的鲁鲁修》里面，鲁鲁修的妹妹娜娜莉喜欢的童话是《爱丽丝梦游仙境》
    '141': ['1', '2', '4', '8'], # 全部动画已被TMA毒害
    '153': '8',  # 在CHD看到了心仪已久却求之不得的资源,下载并感谢楼主，在那之后，做一个有种的人！！
    '155': '1',  # 六脉神剑的六剑分别是：少商剑、商阳剑、中冲剑、关冲剑、少冲剑、少泽剑
    '158': '4',  # 《eden*》中,诗音(Sion)的年龄是100
    '159': '1',  # 提到“读书有三上”的是欧阳修
    '168': '2',  # 微型计算机杂志关于电脑硬件比较多
    '176': ['1', '2', '8'],  # 烂片是《无极》、《满城尽带黄金甲》和《夜宴》
    '178': '1',  # 最准确的圆周率数值是选项C
    '179': '2',  # 蓝光影碟的区码划分与普通DVD不一样
    '183': '4',  # 韦小宝有7个妻子
    '185': ['2', '8'], # 动画片埃及王子的主题曲《when you believe》是由惠特尼·休斯敦,玛利亚·凯莉演唱
    '187': '4',  # 古希腊人和罗马人常用“盐”作为交易媒介来购买奴隶。
    '196': '4',  # 中国古都朝代数由多到少排序：西安、洛阳、北京、南京
    '201': '4',  # 中国第一部有声电影是“歌女红牡丹”
    '202': ['1', '4'],  # 以下哪些网站有提供游戏的评分？Gamespot, IGN
    '203': '2',  # AIR的主题是亲情
    '213': '8',  # 阿凡达是有男有女
    '216': '1',  # 网络中流行的单位“潘”中“一潘”与以下那个选项等价？1000元/平方米
    '234': '4',  # 三国杀中刘备的主公技是激将
    '237': '4',  # DOTA中幻影刺客(PA)的6级大招叫恩赐解脱
    '239': '8',  # 这句“飘神救我！”出自解说“满楼水平”。
    '249': '4',  # 唐朝出现过两个皇帝合葬一个陵墓
    '252': '4',  # 暴雪第一个加入战网(battle.net)的游戏是 暗黑破坏神1
    '258': '1',  # 制作并发布种子;种子得到两个或以上完成数;已有完整文件而下载别人发布的种子
    '261': ['2', '4', '8'], # 仙剑奇侠传1中，能在李大娘的客栈里得到以下十里香,梅花镖,大蒜
    '262': ['2', '4'],  # 三国曹操传中，任何一关都可以使用的武将包括夏侯惇和李典
    '263': '1',  # 《英雄传说III：白发魔女》中白发魔女的名字是耶鲁杜
    '265': ['1', '4', '8'],  # 仙剑奇侠传1中，以下哪些为李逍遥所使用的招式 酒神 剑神 山神
    '267': '4',  # 迄今为止NBA比赛中单场个人得分纪录是张伯伦
    '270': ['1', '2', '8'],  # 经典老牌美剧犯罪现场调查系列
    '276': ['1', '2', '4'],  # 但丁的《神曲》分为三部分，分别是：地狱、炼狱和天堂
    '284': '4',  # 网络中，数据传输速率的大小不直接影响360显示的系统启动速度。
    '285': '4',  # 不是商鞅变法的内容 - 减轻刑罚
    '286': '8',  # 黄河壶口瀑布位于陕西省与山西省之间
    '287': '8',  # 超音速飞机“协和”是法国和英国合作生产的
    '288': '8',  # 三国杀神周瑜发动大业炎的条件是弃掉四张不同花色手牌，掉三点体力
    '290': '4',  # 十二星座中，摩羯座的图腾是羊头鱼身。摩羯座。
    '291': '8',  # 农历新年年初一被称为“鸡日”
    '292': '1',  # 黄瓜的食用部分是它的果实。
    '293': '4',  # 国际象棋起源于印度
    '297': '8',  # 2011-2012欧洲冠军联赛半决赛第2合 皇马vs拜仁 皇马在点球大战中射失点球的是C罗、卡卡和拉莫斯
    '298': '8',  # 人类用无机物合成的第一种有机物是碳酰二胺
    '299': '4',  # 蚊子在晚上如何找到目标？温度
    '301': '1',  # 以下不位于河北境内的古代窑址是龙泉窑
    '302': '8',  # 春秋战国时期的四大死士不包括指盗拓
    '305': '2',  # 王菲的《蝴蝶》是“邮差”的国语版本
    '308': '1',  # 佛经中的天龙八部是指天、龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩侯罗伽
    '309': '4',  # 慈世平的正确名字拼写是Metta World Peace
    '310': '1',  # 星座上将十二个星座分为四类，摩羯 金牛 处女；天秤 双子 水瓶；天蝎 双鱼 巨蟹；狮子 白羊 射手
    '312': '8',  # 未获得过世界杯冠军的足球队 - 荷兰
    '320': '1',  # 世界第一大海是珊瑚海
    '322': '8',  # 哥伦比亚号航天飞机上有7名宇航员
    '323': '8',  # 不属于冬虫夏草自然生长地区的一项是马勒戈壁
    '324': '1',  # 十天干的最后一个是癸
    '328': '8',  # 攻击珍珠港的日本航母有几艘：6
    '330': '2',  # 《红楼梦》中，大观园里的“凹晶馆”的“凹晶”二字是林黛玉拟的
    '332': '2',  # 白居易的《长恨歌》中，第61句和第62句是“春风桃李花开日，秋雨梧桐叶落时。”
    '336': ['1', '2', '4', '8'],  # 中国"四大名绣"
    '344': '1',  # 《一百个人的十年》的作者是冯骥才
    '346': '1',  # 齿形系数与“齿数”有关
    '347': '4',  # “妖都”指的是广州
    '349': '4',  # 雷锋原名是“雷正兴”
    '363': '1',  # 漫画《夏目友人帐》中的猫先生实际叫斑
    '365': '1',  # 2012年伦敦夏季奥运会的金牌含金量为6克。
    '369': '8',  # Vi编辑器中用来调换两个字符位置的命令是xp
    '375': '8',  # 地球不在“七政”之中
    '376': '8',  # 恒星在经历红巨星阶段后塌缩的过程中，决定产物是白矮星还是中子星的临界质量是太阳的1.44倍
    '378': ['1', '4', '8'],  # 下列哪些植物是先开花后长叶儿的？玉兰, 木棉, 海棠
    '387': '2',  # 与中国接壤的 "金砖国家" 有2个。
    '388': '2',  # 与中国接壤的国家有14个。
    '390': ['1', '2', '4', '8'],  # 第一次世界大战的战败国
    '396': ['1', '2', '4'],  # Key社三大催泪弹是air, clannad, kannon
    '397': '1',  # 我们是共产主义接班人
    '401': '8',  # 引文出自狄更斯的《双城记》
    '402': '4',  # 四大名捕中年龄最大的是“追命”
    '404': ['1', '2', '4'],  # 《嘻哈三部曲》是指婚纱照、浮游目击者、绝世高手
    '406': ['2', '4'],  # 2013 LoL S3世界总决赛进入八强的两只中国队伍分别是皇族和OMG
    '414': '8',  # 哪一位不属于“维新三杰” 桂小太郎
    '419': '1',  # 第一部获得奥斯卡最佳影片(Best Picture)提名的动画电影是？《美女与野兽》
    '422': ['1', '2', '8'],  # 在无节操动漫银魂中出现的非人形生物是撒达哈鲁（定春）, 伊丽傻白,作者空知英秋
    '426': ['1', '2', '4', '8'],  # 焦距越长，是全选
    '432': '4',  # TI4上获得冠军豪取500万美刀的队伍是NEWbee
    '434': '4',  # 东风4B型机车有几根车轴？6根
    '436': '1',  # 路明非的QQ小号名字是夕阳的刻痕
    '438': ['1', '2'],  # 下列那些球员不是状元秀：科比，乔丹
    '439': '8',  # 太行山上的明珠是晋城。
    '441': '4',  # 世界上第一片商用CPU是Intel 4004
    '442': '4',  # 最大参考帧ref是12。
    '444': '4',  # 高强混凝土应该的等级是C60及其以上
    '445': '1',  # 方鸿渐在钱钟书的小说《围城》中是乘坐“白拉日隆子爵号”轮船回国的。
    '448': '2',  # 不属于x264中me（全像素(full-pixel)运动估计方法）中的是sex
    '450': ['2', '4', '8'], # 下列哪些是文本字幕格式? SSA SRT ASS
    '451': '4',  # 中国地震最频繁的省份是“台湾”
    '453': '8',  # 《水经》的作者及朝代 - 汉朝桑钦
    '454': ['1', '2', '4', '8'],  # 下列哪些科学家与圆周率探索有关？ 刘徽, 祖冲之, 阿基米德，阿耶波多
    '455': ['2', '4', '8'],
    '457': ['2', '4', '8'],  # 获得奥斯卡奖项最多的影片包括 《指环王3：王者归来》、《宾虚》和《泰坦尼克号》
    '460': ['2', '8'],  # 在C语言中，二进制表示通常以0b或0B开头
    '461': ['1', '8'],  # H.264标准是由ITU和ISO共同提出的
    '466': '2',  # 我国某古代已婚妇人被称为"张王氏"，那么这个妇人在出嫁前姓王
    '467': '4',  # 世界上出现麦田怪圈最多的国家是英国
    '473': '2',  # 在医院做的胸透检查，一般采用的是X射线。
    '474': ['2', '4'],  # 《茶花女》的作者是小仲马，也就是大仲马的儿子。
    '476': '4',  # “七绝圣手”的诗人是王昌龄
    '477': '2',  # “冬天来了，春天还会远吗？” 是哪位诗人的诗句？雪莱
    '478': '2',  # 深圳股市开始计点的时间是“1991”
    '479': '2',  # 中国古典音乐的宫、商、角、藢、羽，与现在音乐的1、2、3、4、5、6、7相比，缺少哪两个音？是4和7。
    '480': '4',  # 蚯蚓属于分解者
    '481': '1',  # 鲁迅在发表《狂人日记》时使用的笔名是鲁迅
    '484': '4',  # 设f(x+1)=x^2-1,则f(x)= = x(x-2)
    '485': '2',  # 发出“上帝死了”之声的哲学家是尼采
    '486': '8',  # “少先队”的全称是中国少年先锋队
    '492': '4',  # 我国进行抗美援朝是在1950年10月
    '493': '2',  # 钢琴上共有黑键36个
    '494': '4',  # 一个标准的3x3魔方总共由26个小块组成
    '498': '8',  # 晁盖等人是在黄泥冈夺取的生辰纲。
    '500': '1',  # 以5mm为一个号
    '501': '4',  # 张曼玉在《花样年华》中换了23件旗袍
    '502': '4',  # 寒山寺位于“苏州城西”
    '503': '4',  # 骆驼的胃分为3个室
    '504': '4',  # 人的乳牙有多少颗呢？20
    '505': '1',  # 《金瓶梅》中的梅指的是春梅
    '507': '8',  # 希特勒出生于奥地利
    '509': '4',  # 医用消毒酒精中乙醇的浓度为95%的说法是错误的
    '510': '8',  # 正确答案是As; add
    '511': '8',  # 英语语法填空题的正确答案
    '512': '8',  # It was five o'clock in the afternoon when they climbed up to the top of the mountain.
    '513': '8',  # 若将云母介质移出，则电容器极板上的电荷量变小，极板间的电场强度不变
    '514': '4',  # 二氧化碳供应不足最终可引起绿色植物释放氧气的减少，最直接的原因是ADP、Pi、NADP+ 减少使水的光解减少
    '515': '4',  # 二氧化碳供应不足最终可引起绿色植物释放氧气的减少，最直接的原因是ADP、Pi、NADP+ 减少使水的光解减少
    '516': '1',  # 儒学的政治地位最为稳固
    '523': '2',  # 我国最早在奥运会上夺金牌的是哪位运动员? 许海峰
    '528': '1',  # 小雨的降雨量为10毫米以下。
    '529': '4',  # "织女星"是属于天琴座。
    '531': '2',  # 企鹅一般在几月份产卵？5月
    '534': '2',  # 一般来说，同一只手上哪个手指的指甲生长得最快？中指
    '535': '8',  # 答案表示《西游记》中的火焰山位于今天的吐鲁番盆地。
    '538': '8',  # 兔子的眼睛之所以看起来是红色的，是因为兔子的眼膜是透明的
    '540': '2',  # 世界上最深，容量最大的淡水湖，被称为“西伯利亚的蓝眼睛”是贝加尔湖
    '541': '8',  # “建设有中国特色的社会主义理论的精髓”指的是“解放思想，实事求是”
    '542': '8',  # 美国１７８７年宪法规定，解释宪法的权力在：最高法院
    '543': '1',  # 世界第一大教堂？圣彼得大教堂
    '544': '1',  # 代表“自负、自恋、尊敬”的花是水仙
    '545': '1',  # 人体通常可以自制维生素K
    '548': '1',  # 远视眼患者应该少吃：高脂肪食品
    '549': ['1', '4'],  # 法语数数涉及的所有四则运算
    '550': '8',  # 哥德巴赫猜想中人们常说的1+1=2，1和2是指：1是一个质数，2是一个大于2的偶数
    '552': '4',  # 费马的职业是律师
    '553': '4',  # 安德鲁·怀尔斯于1994年证明了数论中历史悠久的“费马大定理”，菲尔兹奖银质奖章
    '554': '2',  # 华罗庚的学生中谁证明了“1+5”？潘承洞
    '555': ['1', '2', '4', '8'],  # 了解一点点
    '556': '4',  # 世界著名科学家，空气动力学家，中国载人航天奠基人钱学森
    '557': '8',  # 撰写了《国史大纲》，与吕思勉、陈垣、陈寅恪并称为“史学四大家”的是钱穆
    '561': '8',  # 被称为“两弹元勋”的是“邓稼先”
    '562': ['1', '4'],  # 英国皇家学会会长，英国著名的物理学家，百科全书式的“全才”，的人是艾萨克•牛顿（Isaac Newton）和牛顿
    '563': '8',  # 是谁先提出金本位的？艾萨克牛顿
    '564': '1',  # 正确答案是艾萨克牛顿
    '565': '4',  # 某农村小伙身份证130638xxxxxxxx2471，请问他的出生地是河北省保定市雄县
    '566': '4',  # 25号元素是？锰
    '567': '8',  #世界上熔点最高的金属是钨
    '568': '8',  # 最硬的元素是C，即碳元素，金刚石是碳的一种同素异形体，是自然界中最硬的物质。
    '569': '4',  # 加碘食盐中碘是以KIO3（碘酸钾）的形式存在的。
    '570': '8',  # 菠菜、洋葱、竹笋等不要和豆腐同时混合食用，会生成的沉淀物是CaC2O4（草酸钙）
    '571': ['1', '2', '4', '8'],  # 治疗胃的药物尽量避免氢氧化铝的药剂、少吃油条、少食铝制品包装的食品。
    '572': ['1', '2', '4'],  # 水果中含有2,3-二羟基丁二酸、枸橼酸和2－羟基丁二酸，这些成分有助于解酒。
    '574': '2',  # 长期使用铝制品作为食品容器会引发老年痴呆症
    '575': '4',  # 缺碘易患坏血病（错误，缺碘易患甲状腺肿大，坏血病是因为缺乏维生素C）
    '576': '1',  # 下列哪些蚊子会吸人的血？ 雌蚊
    '577': '4',  # 严重缺氧的病人输氧时，要在纯氧中混入5％的CO2，目的是CO2可维持呼吸中枢的兴奋。
    '578': '4',  # 蜻蜓点水是蜻蜓在产卵
    '579': '4',  # 纯牛奶，酸牛奶，酸酸乳
    '580': '4',  # 五条直线相交，最多能有的交点数是“10”
    '581': '2',  # 匠心，别有洞天，浑成
    '583': '8',  # 浮萍破处见山影,小艇归时闻草声。
    '585': '2',  # 下列哪种碱基只存在于RNA中而不存在于DNA中？尿嘧啶
    '587': '8',  # MySQL返回当前日期的函数是curdate()
    '588': '8',  # SELECT COUNT(SAL) FROM EMP GROUP BY DEPTNO; 意思是求每个部门中工资的个数
    '589': '8',  # 在MySQL中，建立数据库使用的语句是CREATE DATABASE
    '590': '1',  # 在正则表达式中，匹配任意一个字符的符号是 .
    '591': '4',  # 在C语言中，表达式5%2的结果是1
    '592': '2',  # C语言中，设整型变量 a=2，浮点型变量b的值不为0.5的是b=(float)(1/a)
    '593': '1',  # C语言中若“int n; float f=13.8;”则执行“n=(int)f%3”后，n的值是1
    '594': '2',  # FFmpeg项目是由Fabrice Bellard最早发起的
    '595': '2',  # RTMP工作在TCP之上，默认使用端口是1935
    '596': '2',  # ffmpeg –i rtsp://192.168.1.1:5555/test –vcodec copy out.avi 命令的作用是录制视频。
    '597': '2',  # ffmpeg的libavformat主要功能是 音视频封装格式的生成和解析
    '598': '2',  # 使用ffmpeg为视频添加字幕的正确命令 ffmpeg -i input.mkv -i subtitles.srt -c copy output.mkv
    '599': '2',  # 使用ffmpeg切割视频的正确命令是 ffmpeg -ss 00:00:00 -i input.mp4 -c copy -t 60 output.mp4。
    '600': '1', # 下列战役中，被陈毅元帅称作【人民群众用小车推出来的】是？
    '601': '1', # "孤舟蓑笠翁，独钓寒江雪"是哪位诗人的作品？
    '602': '1',  # 100BASE-T 以太网中的 "T" 指的是？
    '604': '2', # 银河护卫队1最后彩蛋出现一只鸭子，是谁？
    '605': '4', # 下面哪一项不属于我国古代的四大名楼？
    '606': '1', # 移动副的自锁条件是    ；转动副的自锁条件是      。
    '607': '1',  # 我国第一部叙事详备的编年体史书是？
    '609': '2', # 在硝酸和钼酸铵作用下有黄色沉淀的矿物是
    '611': ['1', '2', '8'], # 汽车的动力提升跟哪几项有关
    '612': '1', # 中国人民解放军空军建军节是哪一天？
    '613': '8',  # 阿里巴巴和四十大盗的故事，是什么夜谈？
    '614': '4', # 河南豫剧诞生在哪一年？
    '615': '2', # The tidal forces to which an object falling into a black hole__subjected __sufficient to tear the object apart.
    '616': '8', # 连镇铁路不经过哪个地区？
    '617': ['8', '4', '2'],  # 以下哪些是面向对象编程语言
    '619': '2',  # 下列关于颐和园的描述中，正确的是（）。
    '623': '2',  # 新冠核酸检测CT值为25时，可判断为？
    '624': '2',  # LOL S8世界冠军是哪支战队？
    '626': '2',  # 以下哪种激素不是下丘脑合成的？
    '627': '2', # NASA为让美国成为全球首次载人航天而制定的航天计划？
    '628': '2',  # 下列文言文倒装句式，哪个选项与其他三项不同？
    '630': '2',  # 中国有____个省、5个自治区、4个直辖市和2个特别行政区
    '631': '1',  # 琼瑶于什么时间在哪里去世?
    '632': '4', # 以下哪一部漫画作品不是富坚义博的？
    '633': '4',  # 在古代中国，有一套独特的选官制度，它以门第族望为主要依据来选拔人才，该制度在一定程度上维护了士族地主的特权地位，并且在后期出现了诸多弊端，如“上车不落则著作，体中何如则秘书”这种凭借门第就能获取官职的情况。这一制度是（ ）
    '634': '2',  # 什么东西越洗越脏？

    '53': '',  # 下列哪种格式不会出现480P,720P.1080P的分辨率
    '70': '',  # 用户升级和哪些参数直接相关?
    '83': 'ipconfig',  # 下面那条CMD命令式查看IP配置的
    '254': '',  # 《火影忍者》中的传说中的“三忍”是指
    '283': '李伯元',  # 《官场现形记》的作者是：
    '289': '南朝',  # 《文心雕龙》成书于哪个朝代？
    '296': '人民大会堂',  # 新版100元人民币背面是哪个地方的风景？
    '300': '',  # Linux ;Unix ;Windows ;Mac os 哪个是完全开源的系统
    '307': '',  # 下列选项中哪一个不是王家卫的作品
    '315': '阳光灿烂的日子',  # 姜文导演的第一部电影是什么？
    '331': '裴隆',  # “让我们面对现实,让我们忠于理想”，出自哪位历史人物之口？
    '343': '军事委员会',  # 邓小平在政府中的最高职务是？
    '354': '路飞',  # 《海贼王》里，谁要成为海贼王的男人？
    '403': '父亲',  # 在动漫《火影忍者》中，主人公漩涡鸣人的名字“鸣人”是谁起的？
    '405': '',  # 《人生三部曲》包括以下哪三个？
    '409': '王安石',  # 唐宋八大家中哪一个曾经位及宰相
    '425': '巴西',  # 2014年世界杯在哪个国家举行？
    '446': '',  # 下列对围棋的表述正确的是
    '447': '',  # 维护民族团结要做到哪三个尊重？
    '456': '',  # 下列影片中在奥斯卡历史上获得大满贯的（最佳电影、最佳导演、最佳编剧、最佳男主角、最佳女主角）有哪些？
    '464': '20',  # 汉字中的“廿”表示的是阿拉伯数字的几十？
    '465': '格陵兰',  # 世界上最大的岛屿是哪个岛？
    '468': '75',  # 国际上用“K”表示含金量，18k 金表示含金量百分比为百分之多少？
    '469': '紫荆',  # 香港特别行政区的区花是什么？
    '472': '梅花',  # “待到山花烂漫时，她在丛中笑”，“她”指的是什么花？
    '483': '1848',  # 《共产党宣言》宣言在哪一年发表？
    '487': '京剧',  # 中国三大国粹
    '489': '1995',  # 组织（WTO）正式成立于哪一年？
    '490': '紫式部',  # 《源氏物语》的作者是？
    '491': '88',  # 一架标准的三角钢琴共有多少个琴键？
    '495': '壮族',  # 刘三姐是哪个民族的？
    '496': '第六人民医院',  # 我国第一例成功的断肢再植手术是在哪家医院做成的？
    '506': '木星',  # 九大行星中卫星最多的是？
    '519': '瞿塘峡',  # 长江三峡位于最西面的一个峡谷是
    '520': '120',  # 人耳开始感到疼痛的声音叫痛阈，其声级为多少分贝？
    '522': '孙中山',  # 我国植树节定在每年的3月12日,这也是为纪念哪位人物而定的?
    '527': '宋史',  # 《二十四史》中篇幅最大的是哪部？
    '530': '陕北',  # “信天游”是民歌的一种属山歌性质，曲调纯朴、高亢、悠长、节奏自由、你知道它流行于哪一带地方吗？
    '532': '50',  # 人体内的水份约占体重的百分比是多少？
    '537': 'D',  # 缺少哪种维生素后，儿童易患佝偻病，成人易得软骨病？
    '539': '胡萝卜',  # 什么蔬菜被称为营养丰富的“小人参”
    '547': '',  # 中药不可用什么煎：
    '551': '',  # 世界三大数学猜想是？
    '558': '竺可桢',  # 他是中国科学院院士，中国共产党党员，中国近代气象学家、地理学家、教育家。中国近代地理学和气象学的奠基者。请问他是？
    '559': '茅以升',  # 他曾主持修建了中国人自己设计并建造的第一座现代化大型桥梁，成为中国铁路桥梁史上的一块里程碑，他是谁？
    '560': '童第周',  # 中国实验胚胎学的主要创始人，中国海洋科学研究的奠基人，。请问他是谁？
    '573': '',  # 钢是由什么组成的？
    '582': '八百里',  # 辛弃疾在《破阵子·为陈同甫赋壮词以寄之》中表达自己理想的句子是？
}

def get(key=None):
    if key is None:
        return answers_dict.copy()
    else:
        return answers_dict.get(key, False)

def check_key(key):
    return key in answers_dict

# def check_key(key):
#     valid_values = ('1', '2', '4', '8')
#     if key in answers_dict:
#         values = answers_dict[key]

#         if isinstance(values, list):
#             return set(values).issubset(set(valid_values))
#         elif isinstance(values, str):
#             return values in valid_values
#     return False

def find_empty_keys(): # 找到字典中值为空字符串的键
    return [key for key, value in answers_dict.items() if value == '']
